{"meta":{"title":"follow the white rabbit","subtitle":"","description":"","author":"pictureyou","url":"http://example.com","root":"/"},"pages":[],"posts":[{"title":"내가 블로그를 하는 이유","slug":"prologue","date":"2020-09-14T15:46:08.000Z","updated":"2020-09-14T15:46:08.451Z","comments":true,"path":"2020/09/15/prologue/","link":"","permalink":"http://example.com/2020/09/15/prologue/","excerpt":"","text":"#Prologue이 블로그를 본격적으로 시작하기 앞서서, 생각했던 내용들을 적어두고 되새김질 하고자 한다. Follow the white rabbit블로그 이름은 Follow the white rabbit, 영화 Matrix 에서 착안하였다. Neo 가 PC 앞에서 잠들었을 때, 콘솔창(?)에 이런 메세지가 날아온다.&lt;% image_tag wakeup_neo.png %&gt; Wake up, Neo… The Matrix has you… Follow the white rabbit… Neo 가 흰토끼를 쫓아가면서 영화가 시작된다. 나도, 이 블로그를 통해 Matrix 의 결말에 다가갈 수 있지 않을까. #Reasons물론 진짜 이유는 따로 있다. 1. 부자가 되고 싶다온 인류의 염원이 아닐까? 연간 집값 상승률이 웬만한 직장인 연봉 상승률 보다 높은 지금, 내가 할 수 있는것은 무엇일까. 내게도 언젠가 기회가 오겠지만, 나는 그 때 준비가 되어 있을까? 2. 직무 특성상, 성과를 정리하기 어려워서언젠가 포스트를 통해 밝혀 지겠지만, 나는 프로젝트를 끝맺음으로 성과를 내지 않는다. 때때로 얄팍한 기술과 꼼수로 문제를 해결하고 나면 공허하기 까지 하다. 나는 지금 유형의 결과물로 인해 느낄 수 있는 성취감이 필요한 시기를 겪고 있다. 3. 뭘 해야할지 몰라서나는 상대적으로 폐쇄적인 업계에서 일하고 있다. 매번 새로운 기술을 접할때 마다 이미 다른 업계에서 적용한 내용을 참고할 수 있어서 좋지만, 기술 트렌드 follow up 이 매우 느리다는 단점이 있다. 내가 배우고 싶은것, 온갖 내용을 소화하다 보면, 길이 보이지 않을까. 4. 기억하고 싶어서“RAM 이 딸린다” 라는 표현이 가장 적절하다. 내머리속의 지우개 는 아니다. 어디에 어떤 정보가 있는지 까지만 기억하고 (주소값 포인터만 기억) 내용은 잊어버려야 새로운 정보, 빅픽쳐를 보는데 용이하다. 마치 우리가 요즘 전화번호를 외우지 않는 것과 일맥상통한다. 구글이 다 알고 있으니까. 이곳에 적는 내용들은 내가 언젠가 그 문제로 다시 돌아 오더라도, 나만의 형태로 기억할 수 있는 branch 가 되었으면 한다. 5. 말을 조리있게 잘 하고싶어서첫 직장 사수님은 말씀을 정말 조리있게 잘 하셨다. 직무 특성이기도 하지만, 순발력으로 듣는사람이 이해하기 쉽게, 맛깔나는 비유가 곁들여진다. 요즘 나는 어떤 주제에 대해 나의 의견을 피력할때 마다 어디서 부터 어느 수준으로 말해야 하는지 혼란스럽다. 연차가 쌓여갈수록 더 힘들어진다. 6. 스트레스 해소하고 싶어서2019년 말, 일종의 번아웃이 찾아왔다. 의외로 글로 적어서 생각을 배출해 내는것이 스트레스 해소에 도움이 되는것 같았다. 지금은 대략 세번째 번아웃이 찾아왔다. 변화가 필요하다. #Why HEXO?처음에는 블로깅은 생각지도 못했다. Youtube 로 Python 을 공부하고 있었다. (이러이러한 채널들을 봤다.) @얄팍한코딩사전 @나도코딩 @노마드코더 @freecodecamp @KeithGalli 그런데 Python 이나, Git, HTML, CSS 등, 내가 궁금했으나 영상에 나오지 않는 정보를 찾다보니, 매우 깔끔하고 이쁘고 유려하고… 맘에 쏙 드는 블로그들이 많았다. 처음에는 별 생각이 없다가 도메인을 보고 이거다 !!! 싶었다. Github 를 이용하여 호스팅 비용 없이도 블로깅이 가능하고, 더불어 프론트엔드 겉핥기 정도는 할 수 있을것 같았다. 이미 이걸 하면서 node.js 까지… 맛만 봤다. 마크다운(.md) 포맷이 언어별 코드 인용양식도 지원해 주니 이보다 완벽할 수는 없다. 1$ git commit -m &quot;First post!&quot; #Epilogue여기까지, 마크다운 문법 연습이었다. 좋은 자습도구가 되었으면 하는 바램이다. #Reference google.com hello-world.md","categories":[],"tags":[]}],"categories":[],"tags":[]}